app/controllers/api/v1/applications_controller.rb

SELECT `applications`.* FROM `applications` ORDER BY created_at DESC
---
  def index
    applications = Application.order('created_at DESC');

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'S3LLPoyuZYQzScJv1TLxJA4u' LIMIT 1
---
  def show
    application = Application.find_by(token: params[:token])

INSERT INTO `applications` (`token`, `name`, `total_chats`, `created_at`, `updated_at`) VALUES ('SJUSBMp2UJNtiZxd52D38NmW', 'testa', 0, '2022-04-18 01:25:56.015263', '2022-04-18 01:25:56.015263')
---
  def create
    application = Application.new(application_params)

    if application.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'tYRByxC9QFhoo5yNDhaw8VJw' LIMIT 1
DELETE FROM `applications` WHERE `applications`.`id` = 9
---
  def destroy
    application = Application.find_by(token: params[:token])

    if application.present?
      application.destroy

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'riRWH7pPhYAkgsc7LP98ix2R' LIMIT 1
UPDATE `applications` SET `applications`.`name` = 'testa', `applications`.`updated_at` = '2022-04-17 20:49:01.286208' WHERE `applications`.`id` = 7
---
  def update
    application = Application.find_by(token: params[:token])

    if application.present?
      if application.update(application_params)