app/controllers/api/v1/chats_controller.rb

SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 8 AND `chats`.`chat_number` = 3 LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 4
---
    def show
        chat = @application.chats.find_by(chat_number: params[:chat_number])

        if chat.present?

SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 8 ORDER BY `chats`.`id` DESC LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 8 ORDER BY created_at DESC
INSERT INTO `chats` (`total_messages`, `chat_number`, `created_at`, `updated_at`, `application_id`) VALUES (0, 5, '2022-04-18 00:51:18.080112', '2022-04-18 00:51:18.080112', 8)
---
    def create
        recent_chat = @application.chats.last;

        if recent_chat.present?
            recent_chat_number = recent_chat.chat_number
        else
            recent_chat_number = 0
        end

        chat = @application.chats.new(:chat_number => recent_chat_number + 1)

        if chat.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'S3LLPoyuZYQzScJv1TLxJA4u' LIMIT 1
---
    def set_application
        @application = Application.find_by(token: params[:application_id])