app/controllers/api/v1/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 6 AND `messages`.`message_number` = 1 LIMIT 1
---
    def show
        message = @chat.messages.find_by(message_number: params[:message_number])

SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 6 ORDER BY `messages`.`id` DESC LIMIT 1
INSERT INTO `messages` (`message_number`, `created_at`, `updated_at`, `chat_id`) VALUES (2, '2022-04-18 00:51:14.774254', '2022-04-18 00:51:14.774254', 6)
---
    def create
        recent_message = @chat.messages.last;

        if recent_message.present?
            recent_message_number = recent_message.message_number
        else
            recent_message_number = 0
        end

        message = @chat.messages.new(:message_number => recent_message_number + 1)

        if message.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'S3LLPoyuZYQzScJv1TLxJA4u' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`chat_number` = 3 LIMIT 1
---
    def set_chat
        @application = Application.find_by(token: params[:application_id])
        if @application.nil?
            render_json_not_found()
            return
        end

        @chat = Chat.find_by(chat_number: params[:chat_id])